app/controllers/designs_controller.rb

  def update
    if @design.update_attributes(params[:design])
---
UPDATE "designs" SET "page_bg_color" = '70921A', "text_color" = 'AC732E', "link_hover_color" = '7C2727', "border_color" = '329DB8', "link_color" = 'DF3232', "background_color" = '16120E', "title_color" = 'AA2222', "updated_at" = '2009-09-16 23:08:23' WHERE "id" = 14