app/controllers/main_pages_controller.rb

  def send_us_mail
    if logged_in?
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 26) LIMIT 1