app/controllers/pieces_controller.rb

INSERT INTO "pieces" ("image_3_updated_at", "image_5_file_size", "image_1_file_size", "updated_at", "image_2_updated_at", "image_3_file_name", "title", "price", "image_3_file_size", "image_1_updated_at", "image_5_content_type", "image_5_file_name", "image_3_content_type", "image_5_updated_at", "description", "for_sale", "portfolio_id", "image_2_file_name", "image_1_content_type", "image_2_file_size", "image_4_content_type", "image_4_file_name", "position", "created_at", "image_2_content_type", "image_4_file_size", "image_4_updated_at", "image_1_file_name") VALUES(NULL, NULL, 82469, '2009-08-09 20:59:20', NULL, NULL, 'My Masterpiece', NULL, NULL, '2009-08-09 20:59:20', NULL, NULL, NULL, NULL, 'Here is something I have worked my whole life on.', 'f', 29, NULL, 'image/jpeg', NULL, NULL, NULL, NULL, '2009-08-09 20:59:20', NULL, NULL, NULL, '789px-Chinchillapets.jpg')
---
  def create
    @portfolio = current_user.portfolio
    @piece = @portfolio.pieces.create!(params[:piece])

SELECT "pieces".* FROM "pieces" INNER JOIN "portfolios" ON "pieces".portfolio_id = "portfolios".id WHERE ("pieces"."id" = 29 AND (("portfolios".user_id = 26)))
SELECT * FROM "portfolios" WHERE ("portfolios".user_id = 26) LIMIT 1
---
  def edit
    @portfolio = current_user.portfolio
    @piece = current_user.pieces.find(params[:id])

SELECT * FROM "pieces" WHERE ("pieces"."id" = 35)
SELECT * FROM "portfolios" WHERE ("portfolios".user_id = 32) LIMIT 1
UPDATE "pieces" SET "image_2_content_type" = 'image/jpeg', "image_3_file_name" = 'Spring.png', "image_2_updated_at" = '2009-08-06 15:51:37', "image_2_file_name" = 'cowphin.jpg', "image_3_updated_at" = '2009-08-06 15:51:38', "image_3_content_type" = 'image/png', "image_3_file_size" = 481141, "updated_at" = '2009-08-06 15:51:40', "image_2_file_size" = 40869 WHERE "id" = 21
---
  def update
    @portfolio = current_user.portfolio
    @piece = current_user.pieces.find(params[:id])

    if @piece.update_attributes(params[:piece])

SELECT * FROM "pieces" WHERE ("pieces"."id" = 34)
DELETE FROM "pieces" WHERE "id" = 34
---
  def destroy
    if current_user.admin?
      @piece = Piece.find(params[:id])
      @piece.destroy

SELECT "pieces".* FROM "pieces" INNER JOIN "portfolios" ON "pieces".portfolio_id = "portfolios".id WHERE ("pieces"."id" = 29 AND (("portfolios".user_id = 26)))
---
  def show
    @piece = current_user.pieces.find(params[:id])