app/controllers/pieces_controller.rb

  def find_piece
    if current_user.admin?
      @piece = Piece.find(params[:id])
---
SELECT * FROM "pieces" WHERE (1 = 1) ORDER BY position DESC LIMIT 1