app/controllers/portfolios_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 32)
---
  def send_message
    @user = User.find(params[:id])