app/controllers/users_controller.rb

  def reset_password
    @page_title = "Weefolio - Change my Password"

    if request.post?
      user = User.find_by_email(params[:user][:email])
      if user && user.login == params[:user][:login]
        if user.update_attributes(:password => params[:user][:new_password], :password_confirmation => params[:user][:new_password_confirm])
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'maloney.mc@gmail.com' AND "users".id <> 26) LIMIT 1
UPDATE "users" SET "crypted_password" = 'e7fdd4552ce688a2a122a13476ab41e642b1ebb8', "updated_at" = '2009-08-20 20:18:34' WHERE "id" = 26

  def update
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2009-10-29 14:23:31', "about_me" = 'Eu feugiat nulla facilisis at vero eros et accumsan et iusto odio. Et quinta decima eodem modo typi qui nunc nobis videntur parum clari fiant sollemnes in. Wisi enim ad minim veniam quis nostrud exerci; tation ullamcorper suscipit lobortis nisl? Quod ii legunt saepius claritas est etiam processus dynamicus qui sequitur mutationem, consuetudium lectorum mirum. Typi non habent claritatem insitam est, usus legentis in. Dignissim qui blandit praesent luptatum, zzril delenit augue duis dolore.

  def create
    logout_keeping_session!
    @user = User.new(params[:user])

    @user.setup_portfolio_and_design

    @user.activate!
    success = @user && @user.save && @user.portfolio
    if success && @user.errors.empty?
---
INSERT INTO "designs" ("background_color", "text_serif", "title_serif", "tagline_color", "tagline_bold", "header_image_content_type", "updated_at", "link_color", "text_size", "title_bold", "tagline_serif", "css_text", "header_image_file_name", "header_image_updated_at", "header_image_file_size", "title_font", "tagline_font", "title_italic", "tagline_italic", "link_img_border_color", "text_color", "title_color", "page_bg_color", "tagline_size", "user_id", "text_font_1", "background_align", "background_tile", "link_hover_color", "text_font_2", "border_color", "created_at") VALUES('#dedddb', 'f', 't', '#242420', 'f', NULL, '2009-08-06 13:59:30', '#72b225', 12, 'f', 't', NULL, NULL, NULL, NULL, 'Georgia', 'Georgia', 'f', 'f', '#f5f4f4', '#767574', '#242420', '#fff', NULL, NULL, 'Arial', 'center', 'repeat', '#242420', 'Helvetica', '#eee', '2009-08-06 13:59:30')
INSERT INTO "portfolios" ("image_1_file_size", "updated_at", "image_1_updated_at", "image_1_content_type", "user_id", "created_at", "image_1_file_name") VALUES(NULL, '2009-07-21 20:43:25', NULL, NULL, NULL, '2009-07-21 20:43:25', NULL)
INSERT INTO "users" ("name", "salt", "address1", "city", "card_expiration_month", "created_at", "activated_at", "about_me", "photo_file_size", "address2", "zip", "card_verification", "crypted_password", "remember_token_expires_at", "account_tier", "country", "card_type", "updated_at", "photo_file_name", "activation_code", "photo_content_type", "card_number", "has_read_terms", "admin_user", "photo_updated_at", "remember_token", "last_name", "tag_line", "login", "design_type", "email", "first_name", "state", "card_expiration_year") VALUES('', 'eddcca036583172dc3c2e79ec9f1b93794ad27be', NULL, NULL, NULL, '2009-09-15 23:44:56', '2009-09-15 23:44:55', NULL, NULL, NULL, NULL, NULL, '579dcb53ccf20785412c4eaf9317fa6ab70d1a64', NULL, 1, NULL, NULL, '2009-09-15 23:44:56', NULL, 'bb34f9b1645d298cff7916e78ecbd223c19994b8', NULL, NULL, 'f', 'f', NULL, NULL, NULL, NULL, 'kevin', 1, 'hello@kevinjohngomez.com', NULL, NULL, NULL)
SELECT * FROM "users"

  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?
---
SELECT * FROM "users" WHERE ("users"."activation_code" = '1b6453892473a467d07372d45eb05abc2031647a') LIMIT 1

  def switch_design_type
    @user = current_user
    if @user.design_type == 1
      @user.set_design_type(2)
    else
      @user.set_design_type(1)
    end
    @user.save
---
UPDATE "users" SET "updated_at" = '2009-10-29 03:41:17', "design_type" = 2 WHERE "id" = 27

  def users_admin
    @users = User.find(:all)
---
SELECT * FROM "users" WHERE ("users"."id" = 32) LIMIT 1